app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "slug", "is_published") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    if @post.save